In [28]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline  
import seaborn as sns
import statsmodels.api as sm
from scipy.stats import boxcox
pd.options.display.max_rows = 100

Split the df so that no students from different country are in different

In [29]:
student_df = pd.read_csv('student_df.csv')

In [30]:
students_test = pd.read_csv('students_test.csv')

In [38]:
st_df = students_test.sort_values('country')

In [31]:
df = student_df.sort_values('country')

In [32]:
df

     student_id student__first_name    country  age  has_rabbit
0             1               David  Argentina   24        True
579         580               Alice  Argentina   22       False
160         161               Grace  Argentina   23        True
163         164               Isaac  Argentina   21        True
944         945                Emma  Argentina   19        True
..          ...                 ...        ...  ...         ...
456         457               Julia        USA   25        True
453         454               Frank        USA   20        True
451         452                Emma        USA   18        True
485         486               David        USA   24       False
999        1000               Alice        USA   19        True

[1000 rows x 5 columns]

In [36]:
mid_point = len(df)/2
mid_point

500.0

In [37]:
df.loc[500, 'country']

'Canada'

In [34]:
students_test

      student_id student__first_name    country  age  has_rabbit
0              1               Julia       Peru   20        True
1              2               Ahmet  Indonesia   21        True
2              3               Anton  Indonesia   18       False
3              4               Frank  Indonesia   35       False
4              5           Huan-Chan     Panama   35       False
...          ...                 ...        ...  ...         ...
4995        4996               Grace     Poland   23       False
4996        4997               Alice      China   38       False
4997        4998              Hannah     Canada   22        True
4998        4999            Penelope  Kyrgystan   38       False
4999        5000              Miguel     Brazil   27        True

[5000 rows x 5 columns]